telephony
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip add 192.168.10.1 255.255.255.0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#ip dhcp pool voz
Router(dhcp-config)#network 192.168.10.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.10.1 
Router(dhcp-config)#option 150 ip 192.168.10.1
Router(dhcp-config)#exit
Router(config)#
Router(config)#telephony-service
Router(config-telephony)#max-dn 8
Router(config-telephony)#max-ephones 8
Router(config-telephony)#ip source-add 192.168.10.1 port 2000
Router(config-telephony)#auto assign 1 to 8
Router(config-telephony)#exit
Router(config)#ephone-dn 1
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 1.1, changed state to up

Router(config-ephone-dn)#number 001
Router(config-ephone-dn)#
Router(config-ephone-dn)#ephone-2
                          ^
	
Router(config-ephone-dn)#ephone-dn 2
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 2.1, changed state to up

Router(config-ephone-dn)#number 002
Router(config-ephone-dn)#
Router(config-ephone-dn)#ephone-dn 3
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 3.1, changed state to up

Router(config-ephone-dn)#number 003
Router(config-ephone-dn)#
Router(config-ephone-dn)#ephone-dn 4
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 4.1, changed state to up

Router(config-ephone-dn)#number 004
Router(config-ephone-dn)#~
                         ^
% Invalid input detected at '^' marker.
	
Router(config-ephone-dn)#ephone-dn 5
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 5.1, changed state to up

Router(config-ephone-dn)#number 005
Router(config-ephone-dn)#
	
Router(config-ephone-dn)#ephone-dn 6
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 6.1, changed state to up

Router(config-ephone-dn)#number 006
Router(config-ephone-dn)#
Router(config-ephone-dn)#ephone-dn 7
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 7.1, changed state to up

Router(config-ephone-dn)#number 007
Router(config-ephone-dn)#
Router(config-ephone-dn)#ephone-dn 8
Router(config-ephone-dn)#%LINK-3-UPDOWN: Interface ephone_dsp DN 8.1, changed state to up

Router(config-ephone-dn)#number 008
Router(config-ephone-dn)#
Router(config-ephone-dn)#exit
Router(config)#
Router(config)#

switch-server
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 2
Switch(config-vlan)#nome dados

	
Switch(config-vlan)#name dados
Switch(config-vlan)#exit
Switch(config)#vtp domain digital
Changing VTP domain name from NULL to digital
Switch(config)#vtp password 123
Setting device VLAN database password to 123
Switch(config)#
Switch(config)#vtp version 2
Switch(config)#
Switch(config)#int range fa0/1-10
Switch(config-if-range)#switchport mode acc
Switch(config-if-range)#switchport voice vlan1

Switch(config-if-range)#switchport voice vlan 1
Switch(config-if-range)#exit
Switch(config)#

	
Switch(config)#int range fa0/11 - 20

	
Switch(config-if-range)#switchport mode acc
Switch(config-if-range)#switchport acc vlan 2
Switch(config-if-range)#exit
Switch(config)#
Switch(config)#int rangefa0/23 - 24
                        ^

	
Switch(config)#int range fa0/23 - 24
Switch(config-if-range)#switchport mode trunk

Switch(config-if-range)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to up

Switch(config-if-range)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

switchh-cliente

Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vtp mode client
Setting device to VTP CLIENT mode.
Switch(config)#vtp domain digital
Domain name already set to digital.
Switch(config)#vtp password 123
Setting device VLAN database password to 123
Switch(config)#int range fa0/1 -  10
Switch(config-if-range)#switchport mode acc
Switch(config-if-range)#switchport voice vlan 1
Switch(config-if-range)#exit
Switch(config)#